app/controllers/timers_controller.rb

SELECT "timers".* FROM "timers"
---
  def index
    @timers = Timer.all

INSERT INTO "timers" ("name", "phone_number", "time", "created_at", "updated_at", "time_zone", "instruction") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    Time.zone = timer_params[:time_zone]
    @timer = Timer.new(timer_params)

    respond_to do |format|
      if @timer.save

SELECT  "timers".* FROM "timers" WHERE "timers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_timer
      @timer = Timer.find(params[:id])