app/controllers/twilio_controller.rb

	def sms
		from = params[:From].gsub(/^\+\d/, '')

		@timer = Timer.find_by(name: "work")
---
SELECT  "timers".* FROM "timers" WHERE "timers"."name" = ? LIMIT ?  [["name", "work"], ["LIMIT", 1]]